from enum import Enum

class Before_Language(Enum):
    RU = 'ru'
    EN = 'en'


class After_Language(Enum):
    RU = 'ru'
    EN = 'en'
'''
Поддерживаемые языки
af — Африкаанс
am — Амхарский
ar — Арабский
az — Азербайджанский
ba — Башкирский
be — Белорусский
bg — Болгарский
bn — Бенгальский
bs — Боснийский
ca — Каталанский
ceb — Себуанский
cs — Чешский
cv — Чувашский
cy — Валлийский
da — Датский
de — Немецкий
el — Греческий
emj — Эмодзи
en — Английский
eo — Эсперанто
es — Испанский
et — Эстонский
eu — Баскский
fa — Персидский
fi — Финский
fr — Французский
ga — Ирландский
gd — Шотландский (гэльский)
gl — Галисийский
gu — Гуджарати
he — Иврит
hi — Хинди
hr — Хорватский
ht — Гаитянский
hu — Венгерский
hy — Армянский
id — Индонезийский
is — Исландский
it — Итальянский
ja — Японский
jv — Яванский
ka — Грузинский
kazlat — Казахский (латиница)
kk — Казахский
km — Кхмерский
kn — Каннада
ko — Корейский
ky — Киргизский
la — Латынь
lb — Люксембургский
lo — Лаосский
lt — Литовский
lv — Латышский
mg — Малагасийский
mhr — Марийский
mi — Маори
mk — Македонский
ml — Малаялам
mn — Монгольский
mr — Маратхи
mrj — Горномарийский
ms — Малайский
mt — Мальтийский
my — Бирманский
ne — Непальский
nl — Нидерландский
no — Норвежский
os — Осетинский
pa — Панджаби
pap — Папьяменто
pl — Польский
pt — Португальский
pt-BR — Португальский (бразильский)
ro — Румынский
ru — Русский
sah — Якутский
si — Сингальский
sk — Словацкий
sl — Словенский
sq — Албанский
sr — Сербский
sr-Latn — Сербский (латиница)
su — Сунданский
sv — Шведский
sw — Суахили
ta — Тамильский
te — Телугу
tg — Таджикский
th — Тайский
tl — Тагальский
tr — Турецкий
tt — Татарский
udm — Удмуртский
uk — Украинский
ur — Урду
uz — Узбекский
uzbcyr — Узбекский (кириллица)
vi — Вьетнамский
xh — Коса
yi — Идиш
zh — Китайский
zu — Зулу
'''